<a href="https://colab.research.google.com/github/dpermana-ops/PengalamanBelajar/blob/main/Assignment_Day_3_Denny_Permana.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Tugas-1: Membuat Sendiri Dataset Customer Profile dan mencari Customer Terloyal

In [2]:
import pandas as pd

In [3]:
# Build Data record

ds_nama = ['Denny Permana', 'Arie Hendarin', 'Hendra Wardhana', 'Yeni Zahrini', 'Titi Inayati', 'Ismet Wijaya', 'Agus Rinaldi',
          'Rizal Irawan', 'Linda Catalina', 'Hasna Fauziah']
ds_tmpt_lahir = ['Jakarta','Jakarta','Bogor','Pekanbaru','Manado','Bandung','Bandung','Padang','Lampung','Makasar']
ds_tgl_lahir = [
    '02/02/1980','07/09/1997','12/12/2002','10/11/1950','04/05/2008','11/04/1969','09/25/2000','04/04/2010',
    '11/02/2003','08/03/1998'
]
ds_tgl_blnja = [
    '02/18/2022','07/04/2021','11/12/2021','10/11/2021','05/08/2022','09/19/2021','06/25/2022','02/02/2022','10/07/2021',
    '01/03/2022'
]
ds_rata2_blnja = [1500000, 50000, 75000, 300000, 350000, 70000, 340000, 100000, 85000, 2300000]
ds_total_trx = [7, 3, 6, 2, 5, 4, 6, 9, 10, 1]

In [4]:
 ## Dimasukkan ke dalam satu variable data source

ds = {'Nama': ds_nama, 'Tempat_Lahir': ds_tmpt_lahir, 'Tanggal_Lahir': ds_tgl_lahir, 
      'Tanggal_Terakhir_Belanja': ds_tgl_blnja, 'Rata2_Belanja_perbulan': ds_rata2_blnja, 
      'Total_Transaksi_perbulan': ds_total_trx}

In [5]:
df = pd.DataFrame(data=ds)

In [6]:
df

,Nama,Tempat_Lahir,Tanggal_Lahir,Tanggal_Terakhir_Belanja,Rata2_Belanja_perbulan,Total_Transaksi_perbulan
0,Denny Permana,Jakarta,02/02/1980,02/18/2022,1500000,7
1,Arie Hendarin,Jakarta,07/09/1997,07/04/2021,50000,3
2,Hendra Wardhana,Bogor,12/12/2002,11/12/2021,75000,6
3,Yeni Zahrini,Pekanbaru,10/11/1950,10/11/2021,300000,2
4,Titi Inayati,Manado,04/05/2008,05/08/2022,350000,5
5,Ismet Wijaya,Bandung,11/04/1969,09/19/2021,70000,4
6,Agus Rinaldi,Bandung,09/25/2000,06/25/2022,340000,6
7,Rizal Irawan,Padang,04/04/2010,02/02/2022,100000,9
8,Linda Catalina,Lampung,11/02/2003,10/07/2021,85000,10
9,Hasna Fauziah,Makasar,08/03/1998,01/03/2022,2300000,1

In [7]:
# Mengecek type data

In [8]:
df.dtypes

Nama                        object
Tempat_Lahir                object
Tanggal_Lahir               object
Tanggal_Terakhir_Belanja    object
Rata2_Belanja_perbulan       int64
Total_Transaksi_perbulan     int64
dtype: object

In [9]:
# Mengubah type data agar sesuai 

data_types = {
    'Nama':'string',
    'Tempat_Lahir':'string',
    'Tanggal_Lahir':'datetime64',
    'Tanggal_Terakhir_Belanja':'datetime64',
    'Rata2_Belanja_perbulan':'int32',
    'Total_Transaksi_perbulan':'int8'
}

In [10]:
df = df.astype(data_types)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Nama                      10 non-null     string
 1   Tempat_Lahir              10 non-null     string
 2   Tanggal_Lahir             10 non-null     datetime64[ns]
 3   Tanggal_Terakhir_Belanja  10 non-null     datetime64[ns]
 4   Rata2_Belanja_perbulan    10 non-null     int32
 5   Total_Transaksi_perbulan  10 non-null     int8
dtypes: datetime64[ns](2), int32(1), int8(1), string(2)
memory usage: 498.0 bytes

In [12]:
## Type data telah sesuai

In [13]:
df

,Nama,Tempat_Lahir,Tanggal_Lahir,Tanggal_Terakhir_Belanja,Rata2_Belanja_perbulan,Total_Transaksi_perbulan
0,Denny Permana,Jakarta,1980-02-02,2022-02-18,1500000,7
1,Arie Hendarin,Jakarta,1997-07-09,2021-07-04,50000,3
2,Hendra Wardhana,Bogor,2002-12-12,2021-11-12,75000,6
3,Yeni Zahrini,Pekanbaru,1950-10-11,2021-10-11,300000,2
4,Titi Inayati,Manado,2008-04-05,2022-05-08,350000,5
5,Ismet Wijaya,Bandung,1969-11-04,2021-09-19,70000,4
6,Agus Rinaldi,Bandung,2000-09-25,2022-06-25,340000,6
7,Rizal Irawan,Padang,2010-04-04,2022-02-02,100000,9
8,Linda Catalina,Lampung,2003-11-02,2021-10-07,85000,10
9,Hasna Fauziah,Makasar,1998-08-03,2022-01-03,2300000,1

**MENCARI CUSTOMER YANG PALING LOYAL**

In [14]:
# 1. Customer dengan rata-rata belanja per bulan > 100000

df[['Nama','Rata2_Belanja_perbulan']][df['Rata2_Belanja_perbulan'] > 100000]

            Nama  Rata2_Belanja_perbulan
0  Denny Permana                 1500000
3   Yeni Zahrini                  300000
4   Titi Inayati                  350000
6   Agus Rinaldi                  340000
9  Hasna Fauziah                 2300000

In [15]:
# 2. Mencari Customer dengan Total Transaksi per bulan > 5 kali

df[['Nama','Rata2_Belanja_perbulan']][df['Total_Transaksi_perbulan'] > 5]

              Nama  Rata2_Belanja_perbulan
0    Denny Permana                 1500000
2  Hendra Wardhana                   75000
6     Agus Rinaldi                  340000
7     Rizal Irawan                  100000
8   Linda Catalina                   85000

In [16]:
# 3. Customer dengan rata-rata belanja per bulan > 100000 DAN Total Transaksi per bulan > 5 kali
df[['Nama', 'Rata2_Belanja_perbulan', 'Total_Transaksi_perbulan']][(df['Total_Transaksi_perbulan'] > 5) & (df['Rata2_Belanja_perbulan'] > 100000)]

            Nama  Rata2_Belanja_perbulan  Total_Transaksi_perbulan
0  Denny Permana                 1500000                         7
6   Agus Rinaldi                  340000                         6

***Kesimpulan: Customer yang Loyal adalah Denny Permana dan Agus Rinaldi karena memiliki rata2 belanja per bulan > Rp. 100.000, dan jumlah transaksi per bulan nya > 5 kali***

## **Tugas-2: Mencari Data Kaggle Terkait Business**

## Dataset: Preliminary EDA on Economic Dataset 1980-2020
Source: https://www.kaggle.com/code/algoholiccreations/preliminary-eda-on-economic-dataset-1980-2020/data

Load Data Source

In [28]:
ds = pd.read_csv("Economic Data 9 Countries.csv")

In [29]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 369 entries, 0 to 368
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   stock index          369 non-null    object
 1   country              369 non-null    object
 2   year                 369 non-null    float64
 3   index price          369 non-null    float64
 4   log_indexprice       369 non-null    float64
 5   inflationrate        369 non-null    float64
 6   oil prices           369 non-null    float64
 7   exchange_rate        369 non-null    float64
 8   gdppercent           369 non-null    float64
 9   percapitaincome      369 non-null    float64
 10  unemploymentrate     369 non-null    float64
 11  manufacturingoutput  369 non-null    float64
 12  tradebalance         369 non-null    float64
 13  USTreasury           369 non-null    float64
dtypes: float64(12), object(2)
memory usage: 40.5+ KB

Cek Data Shape dan Apakah ada Data Null

In [30]:
ds.shape

(369, 14)

In [20]:
# Terdapat 14 Columns dan 369 Baris Data

In [31]:
ds.isnull().sum()

stock index            0
country                0
year                   0
index price            0
log_indexprice         0
inflationrate          0
oil prices             0
exchange_rate          0
gdppercent             0
percapitaincome        0
unemploymentrate       0
manufacturingoutput    0
tradebalance           0
USTreasury             0
dtype: int64

In [23]:
# Tidak terdapat data yang Null

Lihat Data dengan perintah head()

In [33]:
ds.head()

,stock index,country,year,index price,log_indexprice,inflationrate,oil prices,exchange_rate,gdppercent,percapitaincome,unemploymentrate,manufacturingoutput,tradebalance,USTreasury
0,NASDAQ,United States of America,1980.0,168.61,2.23,0.14,21.59,0.0,0.09,12575.0,0.07,0.0,-13.06,0.11
1,NASDAQ,United States of America,1981.0,203.15,2.31,0.10,31.77,0.0,0.12,13976.0,0.08,0.0,-12.52,0.14
2,NASDAQ,United States of America,1982.0,188.98,2.28,0.06,28.52,0.0,0.04,14434.0,0.10,0.0,-19.97,0.13
3,NASDAQ,United States of America,1983.0,285.43,2.46,0.03,26.19,0.0,0.09,15544.0,0.10,0.0,-51.64,0.11
4,NASDAQ,United States of America,1984.0,248.89,2.40,0.04,25.88,0.0,0.11,17121.0,0.08,0.0,-102.73,0.12

Mencari tahu negara apa saja yang terdapa di dalam dataset

In [34]:
for country in ds['country'].unique():
    print(country)

United States of America
United Kingdom
India
Japan
Hong Kong
China
Germany
France
Spain

In [27]:
# Terdapat 9 Negara: US, UK, India, Japan, Hongkong, China, Germany, France, Spain

## Melihat rata-rata Income Per Kapita setiap negara pada tahun 2020

In [35]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 369 entries, 0 to 368
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   stock index          369 non-null    object
 1   country              369 non-null    object
 2   year                 369 non-null    float64
 3   index price          369 non-null    float64
 4   log_indexprice       369 non-null    float64
 5   inflationrate        369 non-null    float64
 6   oil prices           369 non-null    float64
 7   exchange_rate        369 non-null    float64
 8   gdppercent           369 non-null    float64
 9   percapitaincome      369 non-null    float64
 10  unemploymentrate     369 non-null    float64
 11  manufacturingoutput  369 non-null    float64
 12  tradebalance         369 non-null    float64
 13  USTreasury           369 non-null    float64
dtypes: float64(12), object(2)
memory usage: 40.5+ KB

In [88]:
ds_perkapita = ds.loc[ds['year'] == 2020, ['country', 'percapitaincome', 'year']]

In [89]:
ds_perkapita.sort_values(by='percapitaincome', ascending=False)

                      country  percapitaincome    year
40   United States of America          63544.0  2020.0
204                 Hong Kong          46324.0  2020.0
286                   Germany          45724.0  2020.0
81             United Kingdom          40285.0  2020.0
327                    France          38625.0  2020.0
368                     Spain          27057.0  2020.0
245                     China          10500.0  2020.0
122                     India           1901.0  2020.0
163                     Japan              0.0  2020.0

### Dari data di atas, terlihat bahwa USA, Hongkong dan Germany, menempati sebagai Negara dengan pendapatan per kapita tertinggi di tahun 2020

## Melihat Unemployment Rate setiap negara di Tahun 2020

In [90]:
ds_unemployment = ds.loc[ds['year'] == 2020, ['country', 'unemploymentrate', 'year']]

In [92]:
ds_unemployment.sort_values(by='unemploymentrate', ascending=False)

                      country  unemploymentrate    year
368                     Spain              0.16  2020.0
40   United States of America              0.08  2020.0
327                    France              0.08  2020.0
122                     India              0.06  2020.0
204                 Hong Kong              0.06  2020.0
286                   Germany              0.06  2020.0
245                     China              0.05  2020.0
81             United Kingdom              0.04  2020.0
163                     Japan              0.03  2020.0

### Dari data tsb, terlihat bahwa Spain disusul dengan USA adalah negara dengan tingkat pengangguran tertinggi dari 9 Negara

## Melihat Data Inflasi

In [94]:
ds_inflation = ds.loc[ds['year'] == 2020, ['country', 'inflationrate', 'year']]

In [97]:
ds_inflation.sort_values(by='inflationrate', ascending=False)

                      country  inflationrate    year
122                     India           0.07  2020.0
245                     China           0.02  2020.0
40   United States of America           0.01  2020.0
81             United Kingdom           0.01  2020.0
286                   Germany           0.01  2020.0
163                     Japan           0.00  2020.0
204                 Hong Kong           0.00  2020.0
327                    France           0.00  2020.0
368                     Spain           0.00  2020.0

### Dari data di atas, terlihat bahwa India, China, dan USA, adalah negara-negara dengan tingkat Inflasi tertinggi

### Kesimpulan sementara, dari 3 indikator di atas, yakni Pendapatan Per Kapita, Tingkat Pengangguran, serta Tingkat Inflasi, maka dapat dikatakan USA bukanlah negara dengan tingkat kesejahteraan terbaik. Karena, walaupun USA memiliki pendapatan perkapita tertinggi, namun tingkat pengangguran dan tingkat inflasi nya sangat tinggi.